[Aaron_Cash]
Attrib1=Great physical strength, excellent reflexes
Attrib10=
Attrib11=
Attrib2=One of the most experienced guards at Arkham
Attrib3=Lasting enmity with Killer Croc
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=AARON CASH
Eyes=Brown
FirstAppear=Arkham Asylum: Living Hell #1 (July, 2003)
Hair=Black
Height=6 ft
Occupation=Arkham Asylum Guard
RealName=Aaron Cash
Story=One of the most senior and respected guards at Arkham, Cash is only afraid of one inmate - Killer Croc, who severely wounded Cash once during a riot at the asylum. Cash remains determined, however, to keep the asylum's inmates under control - and to conquer his fears of Croc.
Weight=185 lb

[Alfred]
Attrib1=Skilled actor
Attrib10=
Attrib11=
Attrib2=Trained in emergency medical techniques
Attrib3=Proficiency with mechanical and computer systems
Attrib4=Expert in domestic sciences
Attrib5=Unflappable manner
Attrib6=Unlike Batman, Alfred is willing to wield firearms in times of crisis
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=ALFRED PENNYWORTH
Eyes=Blue
FirstAppear=Batman #16 (April-May, 1943)
Hair=Black
Height=6 ft
Occupation=Valet
RealName=Alfred Pennyworth
Story=Alfred Pennyworth, after a varied career, was employed as the Wayne family's butler when Bruce Wayne's parents were killed. Alfred raised the young orphan and reluctantly aided him in his quest to become the Batman. His many skills - ranging from cooking to medicine - make him Batman's staunchest ally, along with a formal demeanor that grounds the Dark Knight and deflects those who might otherwise suspect Bruce Wayne's true identity.
Weight=160 lb

[Amadeus_Arkham]
Attrib1=Highly respected psychiatrist, until his fall to insanity
Attrib10=
Attrib11=
Attrib2=Heir to the Arkham land and fortune
Attrib3=Delusional schizophrenic
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=AMADEUS ARKHAM
Eyes=Blue
FirstAppear=Batman #258 (October, 1974)
Hair=Brown
Height=5 ft 11 in
Occupation=Psychiatrist
RealName=Amadeus Arkham
Story=Amadeus Arkham founded the Elizabeth Arkham Asylum for the Criminally Insane, naming it after his mother, whom he euthanized as treatment for her dementia. Building it on the old grounds of his family's historic mansion on the outskirts of Gotham, Amadeus personally treated its first patient - Martin "Mad Dog" Hawkins, who had killed Amadeus's wife and daughter. After administering fatal electro-shock treatments to Hawkins, Amadeus lost all grip on his sanity and was admitted to his own institution.
Weight=175 lb

[Bane]
Attrib1=Master strategist
Attrib10=
Attrib11=
Attrib2=Intense focus
Attrib3=Abnormally strong reaction to Venom, giving him incredibly enhanced physical abilities
Attrib4=Determined to best Batman, and all others who challenge him
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=BANE
Eyes=Brown (when on Venom: Green)
FirstAppear=Batman: Vengeance of Bane #1 (January, 1993)
Hair=Brown
Height=5 ft 6 in (when on Venom: 6 ft 8 in)
Occupation=Professional Criminal
RealName=Unknown
Story=Imprisoned from birth to serve his dead father's sentence, Bane was raised inside the horrific environs of a Santa Prisca prison; his only friend in the hellhole was a teddy bear he named Osito. Finding solace in smuggled books and meditation, he developed incredible powers of concentration. When he was subjected to military experiments using a steroid codenamed Venom, his iron-forged will helped him survive when other test subjects had died, and he managed to escape. Determined to prove his worth, he sought out Batman and broke the Dark Knight's spine. But Batman recovered and managed to best Bane, cutting off the precious Venom supply that transforms Bane into a superhuman.
Weight=140 lb (when on Venom: 350 lb)

[Batman]
Attrib1=Trained to physical and mental peak
Attrib10=Trained in stealth and espionage techniques
Attrib11=Expert escape artist
Attrib2=Arsenal of gadgets, vehicles, and advanced technology
Attrib3=Inventor, detective, genius-level intelligence
Attrib4=Expert in most known forms of martial arts
Attrib5=Trained in all aspects of criminology
Attrib6=Mastery of the physical sciences
Attrib7=Computer expert
Attrib8=Master of disguise
Attrib9=Photographic memory
BaseOfOps=Gotham City
CharacterName=BATMAN
Eyes=Blue
FirstAppear=Detective Comics #27 (May, 1939)
Hair=Black
Height=6 ft 2 in
Occupation=CEO/Philanthropist
RealName=Bruce Wayne
Story=When his parents were gunned down in front of him, young Bruce Wayne resolved to rid Gotham City of the criminal element that took their lives. He trained extensively to achieve mental and physical perfection, in addition to mastering martial arts, detective techniques, and criminal psychology. Dressing as a bat to prey on criminals' fears, Batman fights crime with the aid of specialized gadgets and vehicles, operating out of his secret Batcave below Wayne Manor.
Weight=210 lb

[Black_Mask]
Attrib1=Obsessed with masks
Attrib10=
Attrib11=
Attrib2=Harbors a hatred of Batman and Bruce Wayne
Attrib3=Face resembles a black skull
Attrib4=Feared and powerful mob boss
Attrib5=Skilled marksman, known for his double handguns
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=BLACK MASK
Eyes=Brown
FirstAppear=Batman #386 (August, 1985)
Hair=None
Height=6 ft 1 in
Occupation=Professional Criminal
RealName=Roman Sionis
Story=Following the suspicious death of his multi-millionaire parents in a fire, Roman Sionis inherited their fortune and then went on to bankrupt their company. Saved by a buyout by Bruce Wayne, Sionis came to resent and hate Wayne. Fixated on the concept of masks, Sionis carved one from his father's black coffin and sought revenge; his ensuing battle with the Dark Knight caused his mask to be burnt into his skin, remaking him as the Black Mask. Sionis is now a feared gang leader and one of the most powerful mob bosses in Gotham, with a burning hatred of the Batman.
Weight=195 lb

[Bruce_Wayne]
Attrib1=Trained to physical and mental peak
Attrib10=Trained in stealth and espionage techniques
Attrib11=Expert escape artist
Attrib2=Arsenal of gadgets, vehicles, and advanced technology
Attrib3=Inventor, detective, genius-level intelligence
Attrib4=Expert in most known forms of martial arts
Attrib5=Trained in all aspects of criminology
Attrib6=Mastery of the physical sciences
Attrib7=Computer expert
Attrib8=Master of disguise
Attrib9=Photographic memory
BaseOfOps=Gotham City
CharacterName=BRUCE WAYNE
Eyes=Blue
FirstAppear=Detective Comics #27 (May, 1939)
Hair=Black
Height=6 ft 2 in
Occupation=CEO/Philanthropist
RealName=Bruce Wayne
Story=Born into the wealthy Wayne family, Bruce Wayne had an idyllic childhood, although he was given a strong sense of justice by his moralistic and philanthropic parents, Thomas and Martha. After their violent murder at the hands of a mugger, Bruce dedicated his life to battling the criminal element that took their lives. He left Gotham for many years to train his mental and physical abilities across the globe, finally returning to take up the mantle of the Dark Knight.
Weight=210 lb

[Bruce_Waynes_Parents]
Attrib1=Highly gifted and well-trained surgeon
Attrib10=
Attrib11=
Attrib2=Heir to the Wayne family fortune
Attrib3=Dedicated philanthropist
Attrib4=Mother to Bruce Wayne, wife to Thomas Wayne
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=THOMAS WAYNE / MARTHA WAYNE
Eyes=Blue / Brown
FirstAppear=Detective Comics #33 (November, 1939)
Hair=Black / Brown
Height=6 ft 1 in / 5ft 8in
Occupation=Doctor / Philanthropist
RealName=Thomas Wayne / Martha Wayne
Story=Thomas Wayne was a gifted surgeon and heir to the Wayne fortune. Dedicated to philanthropy as much as medicine, he and his wife Martha were well-known and respected in Gotham. Martha Wayne shared her husband Thomas's charitable nature, and was dedicated to her son Bruce's upbringing. She was well-regarded in Gotham City's social circles, and helped host lavish charity balls at Wayne Manor. Their tragic murder at the hands of a desperate burglar, Joe Chill, in Gotham's Crime Alley shook the city to its core, and led to years of urban blight. It also inspired their son Bruce to eventually become the Batman.
Weight=180 lb / 135 lb

[Calendar_Man]
Attrib1=Obsessed with quirks of the calendar
Attrib10=
Attrib11=
Attrib2=Carefully plans and themes crimes around holidays
Attrib3=
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=CALENDAR MAN
Eyes=Blue
FirstAppear=Detective Comics #259 (September, 1958)
Hair=Brown
Height=6 ft 3 in
Occupation=Professional Criminal
RealName=Julian Day
Story=Fixated on the calendar, Julian Day became Calendar Man, a villain who timed and tied his crimes thematically to certain holidays throughout the year, often leaving clues by which he could be caught. Gotham City's hopes for a day off are often clouded by the knowledge that any holiday of note is likely to be shadowed by Calendar Man's presence.
Weight=175 lb

[Catwoman]
Attrib1=Trained gymnast and athlete
Attrib10=
Attrib11=
Attrib2=Expert hand-to-hand combatant
Attrib3=Highly skilled with her specialized whip, a cat-o'-nine-tails
Attrib4=Capable of astonishing stealth
Attrib5=Obsessed with (and adept at) stealing famous and well-protected items
Attrib6=Drawn to cat motifs
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=CATWOMAN
Eyes=Green
FirstAppear=Batman #1 (Spring, 1940)
Hair=Black
Height=5 ft 7 in
Occupation=Professional Thief
RealName=Selina Kyle
Story=An orphan who learned to survive on Gotham City's streets, Selina Kyle took to thievery to survive... but determined to do it in style, she learned martial arts and trained extensively to perfect her skills at cat burglary. Her criminal activities are often tempered by a reluctant altruism, making her an inconstant villain and occasional hero. She regularly eludes capture by the Dark Knight, and maintains a complicated, adversarial relationship with Batman that frequently turns flirtatious and occasionally legitimately romantic.
Weight=125 lb

[Clayface]
Attrib1=Can alter his physical form, adopting the appearance of nearly anyone
Attrib10=
Attrib11=
Attrib2=His malleable physical form makes him extremely difficult to injure or contain
Attrib3=His touch can be poisonous
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=CLAYFACE
Eyes=Red
FirstAppear=Detective Comics #40 (June, 1940)
Hair=None
Height=6 ft 5 in
Occupation=Professional Criminal
RealName=Basil Karlo
Story=Initially an actor in horror films, Karlo went mad when he learned a classic film of his was to be remade with a different actor in the lead role. He took on the mask of the film's villain, Clayface, and killed several of the remake's cast and crew before being stopped by Batman and Robin. Later, Karlo joined the Mud Pack, an alliance of shape-changing, mutated villains who had subsequently used the name Clayface. While that group was defeated, Karlo tricked his allies and injected himself with the essences of several of them, becoming a superhuman imbued with the abilities to change shape, melt others into protoplasm with a touch, and mimic the powers of heroes or villains he copies.
Weight=265 lb

[Firefly]
Attrib1=Thorough knowledge of flammable agents
Attrib10=
Attrib11=
Attrib2=Extensive arsenal of fire-creating weapons
Attrib3=Scarred over 90% of his body
Attrib4=Sociopath with intense pyromania
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=FIREFLY
Eyes=Blue
FirstAppear=Detective Comics #184 (June, 1952)
Hair=White with black temples
Height=5 ft 11 in
Occupation=Professional Criminal
RealName=Garfield Lynns
Story=A pyromaniac, Garfield Lynns began as a petty criminal but soon graduated to major crimes centering around arson, torching huge parts of Gotham in the process. But his fires soon raged out of his control, leaving him horribly scarred by one of his own blazes. His body is almost fully covered with burns, and he now wears a full-body flame-retardant suit when he's out pursuing his criminal interests between bouts of incarceration in Blackgate.
Weight=165 lb

[Frank_Boles]
Attrib1=Arrogant belief that he is the best guard in Arkham Asylum
Attrib10=
Attrib11=
Attrib2=Uses sarcasm to cover up insecurities and failures
Attrib3=Violent temper has resulted in many injuries to patients
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=Frank Boles
Eyes=Brown
FirstAppear=Batman: Arkham Asylum (Summer, 2009)
Hair=Black
Height=6 ft
Occupation=Arkham Asylum Guard
RealName=Frank Boles
Story=Frank has been working at Arkham for eight years. He has twice been suspended for drinking on the job and regularly holds poker evenings in the guard rooms. Frank is desperate to be top dog at Arkham; he fails to recognize that he is considered untrustworthy and generally disliked.
Weight=185 lb

[Great_White_Shark]
Attrib1=Brilliant financial skills, which he uses for a variety of criminal purposes
Attrib10=
Attrib11=
Attrib2=Scarred visage that makes him resemble a shark
Attrib3=Teeth sharpened to points
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=THE GREAT WHITE SHARK
Eyes=Brown
FirstAppear=Arkham Asylum: Living Hell #1 (July, 2003)
Hair=None
Height=5 ft 11 in
Occupation=Professional Criminal
RealName=Warren White
Story=A crooked financier who stole millions of dollars, Warren White thought he'd scored a legal victory when his insanity plea went through. But when he got to Arkham Asylum, he realized his mistake; driven insane by the other inmates, he was also disfigured by an encounter with Mr. Freeze that left him without hair, a nose, ears, or lips. Calling himself the Great White Shark, he filed his teeth into fangs to more perfectly resemble his new namesake. Putting his financial skills to use, he has become a major player in Gotham's underground crime scene, running a number of rackets from his cell in Arkham.
Weight=180 lb

[Harley_Quinn]
Attrib1=Surprising strength and stamina
Attrib10=
Attrib11=
Attrib2=Superior gymnastic skills
Attrib3=Total disregard for human life
Attrib4=Like The Joker, she is a homicidal psychotic who escapes easy classification
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=HARLEY QUINN
Eyes=Blue
FirstAppear=Batman: Harley Quinn #1 (October, 1999)
Hair=Blonde
Height=5 ft 7 in
Occupation=Professional Criminal
RealName=Dr. Harleen Quinzel
Story=An Arkham Asylum psychiatrist assigned to treat The Joker, Dr. Harleen Quinzel instead became obsessively fixated on her patient, believing herself to be in love with him. She helped him escape confinement and took on her own criminal identity as Harley Quinn. Quinn is a violent and unpredictable felon whose only motivation, beyond general mayhem, is achieving The Joker's approval. Because of his cruel and mercurial nature, this in some ways makes her just another of his victims, albeit a very dangerous one.
Weight=140 lbs

[Hugo_Strange]
Attrib1=Trained to physical perfection
Attrib10=
Attrib11=
Attrib2=Brilliant psychological analyst
Attrib3=Extensive knowledge of genetics
Attrib4=Obsessed with Batman and Batman's secret identity
Attrib5=Plagued by schizophrenic episodes that leave him confused and dangerous
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=PROFESSOR HUGO STRANGE
Eyes=Grey
FirstAppear=Detective Comics #36 (February, 1940)
Hair=None
Height=5 ft 10 in
Occupation=Psychiatrist
RealName=Professor Hugo Strange
Story=First gaining fame as a psychiatrist who declared that he'd fully analyzed the Dark Knight from afar, Professor Hugo Strange lent credence to his own claims by deducing Batman's true identity as Bruce Wayne. However, his interest in the Batman turned into a deranged obsession, and he's used his medical expertise to hatch a series of bizarre plots based around genetics and mind control in order to defeat the Batman and possibly take his place. Strange's fragile mental state has left him with intermittent knowledge of Batman's true identity, a fact that hangs over Bruce Wayne's head - for if Strange ever snaps completely, Batman's greatest secret might be revealed...
Weight=160 lb

[Humpty_Dumpty]
Attrib1=Extremely tall, heavy, and strong
Attrib10=
Attrib11=
Attrib2=Possesses an almost unnaturally quiet, deliberate nature
Attrib3=Ritualized childhood abuse has led to a severe case of arrested development and an inability to assimilate into modern society
Attrib4=Obsessed with the processes of disassembly and reassembly
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=HUMPTY DUMPTY
Eyes=Brown
FirstAppear=Arkham Asylum: Living Hell #1 (July, 2003)
Hair=None
Height=6 ft 3 in
Occupation=Professional Criminal
RealName=Humphry Dumpler
Story=An obese, bald man nicknamed "Humpty Dumpty" for his egg-like form, Humphry Dumpler is obsessed with taking things apart and putting them back together. His crimes at first were minor break-ins, leading to small mechanical items no longer functioning due to Dumpler's inability to adequately reassemble them after taking them apart. But soon his obsession grew to the point that major disasters occurred in Gotham, and Dumpler's crimes also extended to a gruesome attempt to "fix" his abusive grandmother by dismembering her and then attempting a Frankenstein-like reassembly. At Arkham he is a model inmate, his quiet nature and imposing physique inuring him to the madness surrounding him.
Weight=345 lb

[Jack_Ryder]
Attrib1=Determined reporter
Attrib10=
Attrib11=
Attrib2=Known for his aggressive pursuit of stories
Attrib3=Famous for his controversial talk show
Attrib4=Secret identity as his alter ego, the Creeper
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=JACK RYDER
Eyes=Blue
FirstAppear=Showcase #73 (March, 1968)
Hair=Black
Height=6 ft
Occupation=Investigative Reporter
RealName=Jack Ryder
Story=Jack Ryder is an investigative reporter turned controversial talk show host, well-known for his aggressive manner and his determination to get to the truth. What his viewers don't realize is that he's also the Creeper, a garishly-colored vigilante who Ryder can, with effort, turn into at will - although at that point the Creeper's manic personality takes over. The Creeper is usually on the side of good, and just barely on the side of sanity.
Weight=194 lb

[James_Gordon]
Attrib1=Experienced police officer
Attrib10=
Attrib11=
Attrib2=Trained criminologist
Attrib3=Proficient in hand-to-hand fighting techniques
Attrib4=Expert marksman
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=COMMISSIONER GORDON
Eyes=Blue
FirstAppear=Detective Comics #27 (May, 1939)
Hair=White (formerly brown)
Height=6 ft
Occupation=Police Commissioner
RealName=James W. Gordon
Story=Police Commissioner James W. Gordon dedicated his career to cleaning up the corruption in the Gotham City Police Department, a goal he has come a long way towards accomplishing. He has been equally tough on crime, and in the pursuit of making Gotham City safe for all its citizens, Gordon has forged an uneasy alliance with Gotham's other top crime fighter, the mysterious vigilante known as Batman.
Weight=180 lb

[Joker]
Attrib1=Unrepentant homicidal maniac, albeit without a precise psychological diagnosis
Attrib10=
Attrib11=
Attrib2=Surprisingly strong hand-to-hand combatant
Attrib3=His past is unknown; conflicting, unconfirmed reports state that he was a failed comedian, a petty thief, and a broken family man
Attrib4=Employs various deadly weapons, often based on party-gag items
Attrib5=Frequently uses a toxin that stretches victim's face into a Joker-like grin and causes death
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=THE JOKER
Eyes=Green
FirstAppear=Batman #1 (Spring, 1940)
Hair=Green
Height=6 ft
Occupation=Professional Criminal
RealName=Unknown
Story=An insanely homicidal super-villain, the Joker's white skin, green hair, and blood-red lips belie the chaotic nature underlying his cartoonish appearance. The self-styled Clown Prince of Crime has no superpowers beyond a capacity for incredible violence and a skill at creating deadly mayhem. He frequently concocts elaborate schemes to entrap his arch nemesis, Batman.
Weight=160 lb

[Killer_Croc]
Attrib1=Killer Croc has incredibly thick, tough skin and razor-sharp teeth and claws
Attrib10=
Attrib11=
Attrib2=An expert wrestler, his strength and stamina are at a near-superhuman level
Attrib3=Heightened senses and extremely fast reflexes
Attrib4=Able to survive in water for extended periods of time
Attrib5=An intense hatred of humanity
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Mobile
CharacterName=KILLER CROC
Eyes=Yellow
FirstAppear=Batman #357 (January, 1984)
Hair=None
Height=11 ft
Occupation=Alligator Wrestler, Gangster, Murderer
RealName=Waylon Jones
Story=Born with a rare mutation that made his skin green and scaly and grew his body to grotesque proportions, Waylon Jones was raised by an alcoholic aunt and bullied relentlessly for his appearance. He briefly worked as a carnival freak under the name Killer Croc, but his misanthropy grew as did his bestial nature, pushing him to a life of crime. As his physical condition and mental state deteriorate, Killer Croc becomes a more bestial foe, increasingly detached from humanity.
Weight=580 lbs

[Killer_Moth]
Attrib1=Obsessed with fame and identity change
Attrib10=
Attrib11=
Attrib2=Skilled inventor
Attrib3=Amoral, and motivated by feelings of insecurity and inadequacy into criminal activities in an attempt at notoriety
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=KILLER MOTH
Eyes=Brown
FirstAppear=Batman #63 (March, 1951)
Hair=Brown
Height=5 ft 9 in
Occupation=Professional Criminal
RealName=Drury Walker, AKA Cameron Van Cleer
Story=Drury Walker was a minor criminal who adopted the identity of Cameron Van Cleer, a master criminal who in turn masqueraded as the costumed super-villain Killer Moth. He is a hired gun for Gotham's gangsters, but his ingenious weaponry, including his cocoon gun, does not protect him from regular defeat at the hands of the Batman.
Weight=155 lb

[Mad_Hatter]
Attrib1=Master of hypnotism and mind control
Attrib10=
Attrib11=
Attrib2=Obsessed with hats, especially one-of-a-kind items
Attrib3=Delusional schizophrenic with a fixation on Alice in Wonderland
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=MAD HATTER
Eyes=Blue
FirstAppear=Batman #49 (November, 1948)
Hair=Red
Height=4 ft 11 in
Occupation=Professional Criminal
RealName=Jervis Tetch
Story=Obsessed from a young age with Lewis Carroll's book Alice's Adventures in Wonderland, Jervis Tetch, an expert hypnotist, embraced a delusion that he was the incarnation of a character in the story, the Mad Hatter. Using his skills for mesmerism, the Mad Hatter has committed many crimes, often themed around the book that inspired him and his love of hats and headgear, going so far as to implant his hats with mind-control chips to amplify his hypnosis skills. Above all other headwear, however, he covets Batman's distinctive cowl, and will stop at nothing to acquire it.
Weight=115 lb

[Maxie_Zeus]
Attrib1=Driven by complex religious delusions
Attrib10=
Attrib11=
Attrib2=Charismatic leader who has developed a long-standing cult
Attrib3=Determined to extend his powerful reach and recruit new followers
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=MAXIE ZEUS
Eyes=Brown
FirstAppear=Detective Comics #483 (May, 1979)
Hair=Brown
Height=5 ft 6 in
Occupation=Professional Criminal
RealName=Maxie Zeus
Story=A deranged gang leader, Maxie Zeus came to believe himself an avatar of the Olympian god Zeus. Creating a cult of gang members to do his bidding, Zeus became a power-player in the Gotham City underworld. His criminal activities are perpetrated by his army of followers, and—he believes—overseen by the Greek gods themselves.
Weight=135 lb

[Mr_Freeze]
Attrib1=Scientific genius, with a specialty in cryogenics
Attrib10=
Attrib11=
Attrib2=Employs an extensive array of cryo-weaponry
Attrib3=His body has been permanently altered to survive at a sub-freezing state
Attrib4=Wears protective, freezing armor whenever he's out in an above-zero climate
Attrib5=Motivated by his grief and anger over the fate of his wife Nora
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=MR. FREEZE
Eyes=Blue
FirstAppear=Batman #121 (February, 1959)
Hair=None
Height=6 ft
Occupation=Professional Criminal
RealName=Dr. Victor Fries
Story=Victor Fries was a brilliant cryogenicist whose beloved wife Nora was stricken with a fatal degenerative disease. He placed her in suspended animation while obsessively searching for a way to cure her, but the corporation that funded his research - and Nora's life - pulled the plug, triggering an accident that transformed Fries' body into a cold-blooded form that must always be kept below zero; at normal room temperature he will die. Wielding a number of freezing weapons, he wears protective armor in his quest to somehow bring back his lovely wife and avenge her fate—which he partly holds the Batman responsible for.
Weight=190 lb

[Oracle]
Attrib1=Eidetic memory—almost total recall of everything she sees and reads
Attrib10=
Attrib11=
Attrib2=Extensive headquarters in Gotham City's Clock Tower, filled with information archives
Attrib3=High-level hacking and computer skills
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=ORACLE
Eyes=Blue
FirstAppear=Detective Comics #359 (January, 1967)
Hair=Red
Height=5 ft 11 in
Occupation=Information Broker
RealName=Barbara Gordon
Story=The daughter of Gotham City's Police Commissioner James W. Gordon, Barbara Gordon was forbidden by her overprotective father from joining the GCPD. Instead, she took on the identity of Batgirl and was a crime-fighting partner of Batman for years. But that all ended when the Joker shot her through the spine. Paralyzed from the waist down and confined to a wheelchair, Barbara adopted the new identity of Oracle, and now aids the Dark Knight with her computer expertise, providing Batman with a constant stream of information in the field to aid his battle against crime.
Weight=126 lb

[Penguin]
Attrib1=Criminal and financial mastermind
Attrib10=
Attrib11=
Attrib2=Expert hand-to-hand combatant
Attrib3=Driven by a need to prove himself in spite of his comical appearance
Attrib4=Employs various weapons, many based on umbrellas and birds
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=THE PENGUIN
Eyes=Blue
FirstAppear=Detective Comics #58 (December, 1941)
Hair=Brown
Height=5 ft 2 in
Occupation=Restaurateur / Racketeer
RealName=Oswald Chesterfield Cobblepot
Story=The Penguin, one of Batman's oldest foes, is an eccentric criminal mastermind, known as much for his love of ornithology and trick umbrellas as for his shady business dealings. Gotham's popular Iceberg Lounge serves as Cobblepot's front for a number of illegal financial activities that fund much of the city's underworld. Despite his short stature, the Penguin is a wily foe whose umbrellas conceal a variety of deadly weapons and gadgets.
Weight=175 lb

[Penny_Young]
Attrib1=Graduated from Gotham University with top honors
Attrib10=
Attrib11=
Attrib2=Dedicated to the pursuit of a psychiatric cure for various forms of criminal insanity
Attrib3=Highly focused on career ambitions
Attrib4=Intolerant of people who get in the way of her work
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Arkham Asylum
CharacterName=Dr. Penelope Young
Eyes=Blue
FirstAppear=Batman: Arkham Asylum (Summer, 2009)
Hair=Brunette
Height=5 ft 6 in
Occupation=Head of Research
RealName=Penelope Young
Story=Penny Young was always a brilliant student who was prepared to do anything to advance professionally. She has built up a reputation for being a cold, calculating woman, focused only on the project at hand. She was hired at Arkham Asylum by Warden Quincy Sharp to head up the Asylum's Research Department, and to finally restore to sanity the more deranged of Gotham City's super-villains.
Weight=121 lb

[Poison_Ivy]
Attrib1=An ability to encourage and direct the growth of all plant life
Attrib10=
Attrib11=
Attrib2=Plant genes mixed in with her DNA make her an unpredictable and formidable physical opponent
Attrib3=Exudes natural pheromones that enable her to exert control over victims
Attrib4=Skin secretes a toxin that can make her touch deadly
Attrib5=Pathological drive to rid the world of humanity and make it safe for plant life
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=POISON IVY
Eyes=Green
FirstAppear=Batman #181 (June, 1966)
Hair=Red
Height=5 ft 8 in
Occupation=Professional Criminal
RealName=Pamela Lillian Isley
Story=Botanist Pamela Isley was transformed by a science experiment gone wrong into a plant-human hybrid. With chlorophyll flowing through her veins instead of blood, she developed a toxic touch and a pheromone-fueled talent for seduction. Her crimes have become more ecologically focused as she has increasingly abandoned her human side, identifying more with the natural world. Her unique brand of eco-terrorism often puts her into conflict with Batman, whose iron will usually protects him from her seductive powers.
Weight=115 lb

[Prometheus]
Attrib1=Pathological need to kill law officers
Attrib10=
Attrib11=
Attrib2=Trained to peak physical and mental levels
Attrib3=Arsenal of weapons and deadly gadgets
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=PROMETHEUS
Eyes=Brown
FirstAppear=Prometheus #1 (December, 1997)
Hair=White
Height=6 ft
Occupation=Professional Criminal
RealName=Unknown
Story=A dark reflection of Batman, Prometheus was raised by criminals, who were gunned down by policemen right in front of him. Dedicating his life to destroying the law, Prometheus traveled the world and trained in the ways of murder. Clad in an armored suit that maximizes his natural skills, he is a master assassin whose physical and mental abilities rival Batman's own.
Weight=180 lb

[Ras_Al_Ghul]
Attrib1=Genius intellect and strategist
Attrib10=
Attrib11=
Attrib2=Superior strength and stamina
Attrib3=Superb hand-to-hand combatant, trained over millennia
Attrib4=Nearly immortal thanks to his Lazarus Pits
Attrib5=Commands a legion of followers dedicated to bringing his vision of an Earthly paradise to fruition
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Mobile
CharacterName=RA'S AL GHUL
Eyes=Green
FirstAppear=Batman #232 (June, 1971)
Hair=Grey with white streaks
Height=6 ft 3 in
Occupation=International Terrorist
RealName=Unknown
Story=Little is known of the early years of the nearly immortal Rā's al Ghūl, whose name means "the demon's head", but it is known that he has lived for many centuries due to Lazarus Pits, mystical and alchemical brews that restore his youth. A brilliant master of strategy and organization, Rā's al Ghūl's goal is to save the Earth from ecological devastation by destroying most of its population. He recognizes Batman as both a worthy foe and a possible ally - except that Batman cannot accept his dystopic worldview. Batman also shares a love-hate relationship with Rā's' daughter, the beautiful Talia.
Weight=210 lb

[Ratcatcher]
Attrib1=Thorough knowledge of Gotham's sewer system and Blackgate Prison's layout
Attrib10=
Attrib11=
Attrib2=Eerie ability to wordlessly communicate with and command all rats
Attrib3=Overvalues rodent life, especially in comparison to human life
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=THE RATCATCHER
Eyes=Blue
FirstAppear=Detective Comics #585 (April, 1988)
Hair=Brown
Height=5 ft 11 in
Occupation=Professional Criminal
RealName=Otis Flannegan
Story=Once employed as an actual rat catcher in Gotham, Otis Flannegan soon started using his natural gift - an affinity with and ability to control rats - to stage a variety of crimes. Eventually his control over the vermin grew until he threatened Gotham City with a veritable army of rodents. Incarcerated many times at Blackgate, he's able to do as much damage within prison as without, using his loyal pets to relay messages and transport materials inside the maze of ventilation ducts that wind throughout the giant prison.
Weight=155 lb

[Riddler]
Attrib1=Genius intellect
Attrib10=
Attrib11=
Attrib2=Driven by a need to test his wits against law enforcement by leaving clues to his planned crimes
Attrib3=Compulsive need for attention
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=THE RIDDLER
Eyes=Blue
FirstAppear=Detective Comics #140 (October, 1948)
Hair=Brown
Height=6 ft 1 in
Occupation=Professional Criminal
RealName=Eddie Nashton (aka Edward Nigma)
Story=With an obsessive-compulsive need for attention, Edward Nigma is determined to be the most outlandish of Gotham City's criminals, concocting elaborate series of clues and riddles around his crimes. Batman has proven a worthy opponent, capable of deducing the Riddler's plans, but Nigma is dedicated to creating a mystery the Dark Knight will not be able to solve in time.
Weight=183 lb

[Scarecrow]
Attrib1=Master of psychology and chemistry
Attrib10=
Attrib11=
Attrib2=Creator of fear-inducing gas
Attrib3=Motivated by an obsessive need to create fear in others
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=THE SCARECROW
Eyes=Blue
FirstAppear=World's Finest Comics #3 (Fall, 1941)
Hair=Brown
Height=6 ft
Occupation=Professional Criminal
RealName=Jonathan Crane
Story=Taunted and bullied as a youth, Jonathan Crane vowed to overcome his fears through the study of psychology and biochemistry. Kicked out of his university for experimenting on human subjects, Crane then adopted the identity of the Scarecrow and armed himself with a specialized fear-inducing gas that makes a person's deepest phobias become frighteningly real. His ongoing criminal reign of terror makes him one of Batman's most psychologically dangerous foes.
Weight=140 lb

[Scarface_Puppet]
Attrib1=Puppet animated with eerie verisimilitude by the Ventriloquist
Attrib10=
Attrib11=
Attrib2=Frequently wields under-sized but lethal weaponry
Attrib3=When teamed with the Ventriloquist, acts as an old-style mob boss, with a sociopathic disregard for human life
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=SCARFACE
Eyes=Black
FirstAppear=Detective Comics #583 (February, 1988)
Hair=Black
Height=2 ft 6 in
Occupation=Professional Criminal
RealName=Scarface
Story=Gotham's Blackgate Penitentiary once had a Gallows Tree from which 313 criminals with death sentences were hanged. The wood from that tree was whittled by an inmate into the puppet Scarface, and that inmate was murdered by Arnold Wesker, a man who soon fell under Scarface's influence. While most believe that Scarface is simply a tool through which Wesker, as the criminal mastermind the Ventriloquist, acts out a dark side to his personality, Wesker himself believes that Scarface is possessed by the souls who died beneath the Gallows Tree, and the puppet actually motivates him to commit the duo's many crimes.
Weight=15 lb

[Spirit_Of_Arkham]
Attrib1=NA
Attrib10=
Attrib11=
Attrib2=
Attrib3=
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Arkham Island
CharacterName=The Spirit of Arkham
Eyes=NA
FirstAppear=Batman: Arkham Asylum (Summer, 2009)
Hair=NA
Height=NA
Occupation=NA
RealName=Unknown
Story=Strange writings and symbols that have been found around Arkham Island and deciphered by Batman. These must have been left for a reason. What story do they tell?
Weight=NA

[Spirit_Of_Arkham2]
Attrib1=NA
Attrib10=
Attrib11=
Attrib2=
Attrib3=
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Arkham Island
CharacterName=The Spirit of Arkham
Eyes=NA
FirstAppear=Batman: Arkham Asylum (Summer, 2009)
Hair=NA
Height=NA
Occupation=NA
RealName=Unknown
Story=The writings have revealed a story that cannot possibly belong to just Amadeus Arkham. The story has weaved through time and ended on an individual who must still be alive and working here on Arkham Island. I need to figure out who it is and confront them before they can do any more harm.
Weight=NA

[Spirit_Of_Arkham3]
Attrib1=Intense dedication to "cleaning up" Arkham
Attrib10=
Attrib11=
Attrib2=An alternate personality that is prepared to kill patients to facilitate the cure
Attrib3=Contempt and disgust for all forms of psychiatric disorder that is rooted in self loathing
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Arkham Island
CharacterName=The Spirit of Arkham
Eyes=Blue
FirstAppear=Batman: Arkham Asylum (Summer, 2009)
Hair=Gray
Height=5 ft 8 in
Occupation=Executioner
RealName=Quincy Sharp
Story=Quincy Sharp has long been hiding a secret. Doctors had previously diagnosed him with a schizophrenic personality disorder, but he chose to ignore it. How could someone of his importance be ill like the dogs in his asylum? On taking over the administration of Arkham Asylum, Sharp became obsessed with the hidden writings of Amadeus Arkham. As he read more of these memoirs, he became almost two people; one dedicated to curing Gotham, the other desiring only to eradicate the evil of insanity from Arkham. In his demented state, he has stalked and killed patients, his ultimate goal being to kill the Joker. It is possible the rational side of his personality is not even aware of this dark, destructive force within him.
weight=190 lb

[Tommy_Elliott]
Attrib1=Great physical strength, augmented by a hatred of Bruce Wayne
Attrib10=
Attrib11=
Attrib2=World-class surgeon, capable of extraordinary medical breakthroughs
Attrib3=Master of disguise
Attrib4=Determined to destroy Bruce Wayne
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=HUSH
Eyes=Brown
FirstAppear=Batman #609 (January, 2003)
Hair=Reddish-brown
Height=6 ft 3 in
Occupation=Surgeon
RealName=Thomas "Tommy" Elliot
Story=Tommy Elliot and Bruce Wayne were childhood friends and, unknown to Bruce, dark reflections of each other. A childhood sociopath, Elliot tried to kill his parents so he could inherit their fortune. When his plan failed partly due to the surgical skills of Thomas Wayne, Bruce's father, Elliot blamed Bruce. An incredibly skilled surgeon as an adult, Elliot planned an elaborate revenge scheme on the Batman. He disguised himself as the villain Hush, his face covered in bandages, but he was in the end defeated and unmasked by the Dark Knight. Hush still plots revenge against Batman, generating complicated schemes with surgical precision.
Weight=225 lb

[TweedleDumAndDee]
Attrib1=Obsession with Alice in Wonderland
Attrib10=
Attrib11=
Attrib2=Skilled criminal masterminds
Attrib3=Despite being cousins, could pass as identical twins
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=TWEEDLEDUM AND TWEEDLEDEE
Eyes=Brown
FirstAppear=Detective Comics #74 (April, 1943)
Hair=Brown
Height=5 ft 9 in
Occupation=Professional Criminals
RealName=Deever and Dumfree Tweed
Story=Cousins with an uncanny resemblance to each other, Deever and Dumfree Tweed both shared criminal leanings and a fixation on Lewis Carroll's Alice in Wonderland. Teaming up, they've modeled themselves after Tweedledum and Tweedledee from that book, planning often outrageous, absurdist schemes to trap the Batman.
Weight=175 lb

[Two_Face]
Attrib1=Hideously scarred on the left half of his face, which he plays up with clothing that's differently styled on one side
Attrib10=
Attrib11=
Attrib2=Extremely skilled with his weapons of choice: twin .45 automatics
Attrib3=Psychotic obsession with duality, designing crimes around the number two
Attrib4=Defers to his half-scarred coin in choices of life or death
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=TWO-FACE
Eyes=Blue
FirstAppear=Detective Comics #66 (August, 1942)
Hair=Brown / Grey
Height=6 ft
Occupation=Professional Criminal
RealName=Harvey Dent
Story=District Attorney Harvey Dent was one of Batman's strongest allies in Gotham City, until a criminal threw acid in Dent's face, hideously scarring him. The wounds fractured his psyche, and he was reborn as a schizoid criminal mastermind, obsessed with duality. His former good-luck charm, a "two-headed" trick silver dollar, was damaged on one side in the attack, and Dent has seized on it as a reflection of his half-scarred visage. He flips it to decide the fates of his victims. Despite Batman's efforts to reform his former ally, Dent is consumed by his fixation on chance, and his crimes are designed to prove out his diametric philosophy.
Weight=182 lb

[Ventriloquist]
Attrib1=Delusional schizophrenic with multiple personality disorder
Attrib10=
Attrib11=
Attrib2=Obsessed with his puppet, Scarface, whom he puppeteers with unsettling skill
Attrib3=When teamed with Scarface, the two operate as a criminal mastermind
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=THE VENTRILOQUIST
Eyes=Blue
FirstAppear=Detective Comics #583 (February, 1988)
Hair=Brown
Height=5 ft 7 in
Occupation=Professional Criminal
RealName=Arnold Wesker
Story=Arnold Wesker was a timid orphan whose deep repression erupted in a barroom brawl, resulting in him being sent to Blackgate Prison. There he encountered the puppet Scarface, and promptly murdered the man who'd carved the puppet. The two are now inseparable, with Scarface directing a series of criminal activities. While most believe that Wesker is simply acting out a second personality through the puppet, Wesker sees himself as a reluctant lackey who merely does his puppet's bidding.
Weight=142 lb

[Warden]
Attrib1=Intense dedication to "cleaning up" Arkham
Attrib10=
Attrib11=
Attrib2=Pompous and old-fashioned in demeanor, with a focus on his own political aspirations
Attrib3=Contempt for Arkham inmates and disinterest in the specifics of their treatment masks a cowardly nature
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=Warden Sharp
Eyes=Blue
FirstAppear=Batman: Arkham Asylum (Summer, 2009)
Hair=Gray
Height=5 ft 8 in
Occupation=Warden of Arkham Asylum
RealName=Quincy Sharp
Story=Quincy Sharp has been running Arkham Asylum for the past three years and has dedicated his life to restoring to sanity the so-called super-villains that plague Gotham City. He is currently campaigning to become the next mayor of Gotham; to facilitate this campaign, he has instigated stringent new security and experimental research policies at Arkham.
Weight=190 lb

[Zsasz]
Attrib1=Sociopath with no regard for human life
Attrib10=
Attrib11=
Attrib2=No pattern of killing, making him difficult to track
Attrib3=Compulsive need to kill others
Attrib4=
Attrib5=
Attrib6=
Attrib7=
Attrib8=
Attrib9=
BaseOfOps=Gotham City
CharacterName=MR. ZSASZ
Eyes=Blue
FirstAppear=Batman: Shadow of the Bat #1 (June, 1992)
Hair=Blond
Height=5 ft 8 in
Occupation=Professional Criminal
RealName=Victor Zsasz
Story=A true sociopath, Zsasz grew up in a life of ease but nonetheless became a serial killer. Indiscriminate in his prey, body count is the only thing that matters to Zsasz. He takes pleasure in arranging the corpses of his victims in life-like poses before carving a mark for each of his victims into his own body. He is saving a special spot for the Batman.
Weight=150 lb
